package algorithms

// 문자열 ────────────────────────────────────────────────────────
// 팰린드롬 -> 투 포인터
//



// 입력 ────────────────────────────────────────────────────────
// 종료조건 없는 입력 -> Scanner 이용, while(s.hasNextLine()) {}
// 입력이 많으면 BufferedReader 사용

// 계산 ────────────────────────────────────────────────────────
// Int 범위 초과 확인 필요

// 정렬 ────────────────────────────────────────────────────────
// list.sortBy { it.length }
// list.sortWith {}

// 최대 최소 ────────────────────────────────────────────────────────

// 10818번
// 리스트 sort()로 구현 -> 2084ms
// 스캐너를 이용한 min, max 찾기로 구현 -> 1464ms
// 버퍼리더를 이용한 min, max 찾기로 구현 -> 648ms
